node/persistence/db/performance/test/load/short-queries-after-deploy.yml
config:
   phases:
      -  duration: 2
         arrivalRate: 5
      -  duration: 10
         arrivalRate: 5
         rampTo: 50
   defaults:
      headers:
         x-correlation-id: 1

before:
   flow:
      -  function: "removeAll"
      -  function: "fakeNewVersionDeployment"

scenarios:
   -  name: 'query on a few data'
      flow:
         -  post:
               url: "/foo"
               json:
                  count: 10
               expect:
                  -  statusCode: 200
         -  get:
               url: "/foo/short-query"
               expect:
                  -  statusCode: 200